<template>
  <div class="main-page">
    <div class="catalog">
      <div v-for="category in categories" :key="category" class="item-catalog" :class="{ active: activeCategory === category }" @click="filterProductsByCategory(category)">
        {{ category }}
      </div>
      <div class="item-catalog" @click="filterProductsByCategory('all')">
        <svg width="31" height="32" viewBox="0 0 31 32" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M21.7381 16.7075L12.1649 26.7075C12.076 26.8004 11.9704 26.8741 11.8542 26.9244C11.738 26.9747 11.6134 27.0006 11.4876 27.0006C11.3618 27.0006 11.2373 26.9747 11.1211 26.9244C11.0049 26.8741 10.8993 26.8004 10.8103 26.7075C10.7214 26.6146 10.6508 26.5043 10.6027 26.3829C10.5546 26.2615 10.5298 26.1314 10.5298 26C10.5298 25.8686 10.5546 25.7385 10.6027 25.6171C10.6508 25.4957 10.7214 25.3854 10.8103 25.2925L19.7074 16L10.8103 6.70751C10.6307 6.51987 10.5298 6.26537 10.5298 6.00001C10.5298 5.73464 10.6307 5.48015 10.8103 5.29251C10.99 5.10487 11.2336 4.99945 11.4876 4.99945C11.7417 4.99945 11.9853 5.10487 12.1649 5.29251L21.7381 15.2925C21.8271 15.3854 21.8977 15.4957 21.9459 15.6171C21.9941 15.7385 22.0189 15.8686 22.0189 16C22.0189 16.1314 21.9941 16.2615 21.9459 16.3829C21.8977 16.5043 21.8271 16.6146 21.7381 16.7075Z" fill="white"/>
        </svg>
      </div>
    </div>
    <div class="main-wrapper">
      <div style="width: 25%; text-align: start;">
      <div class="profile-wrapper">
        <div class="profile-info">
          <div class="avatar">
            <svg width="75" height="75" viewBox="0 0 75 75" fill="none" xmlns="http://www.w3.org/2000/svg">
            <rect x="0.5" y="0.5" width="74" height="74" rx="37" fill="#20242D" stroke="#363F54"/>
            <path d="M44 39.5C44 39.7967 43.912 40.0867 43.7472 40.3334C43.5824 40.58 43.3481 40.7723 43.074 40.8858C42.7999 40.9994 42.4983 41.0291 42.2074 40.9712C41.9164 40.9133 41.6491 40.7704 41.4393 40.5607C41.2296 40.3509 41.0867 40.0836 41.0288 39.7926C40.9709 39.5017 41.0007 39.2001 41.1142 38.926C41.2277 38.6519 41.42 38.4176 41.6667 38.2528C41.9133 38.088 42.2033 38 42.5 38C42.8978 38 43.2794 38.158 43.5607 38.4393C43.842 38.7206 44 39.1022 44 39.5ZM33.5 38C33.2033 38 32.9133 38.088 32.6667 38.2528C32.42 38.4176 32.2277 38.6519 32.1142 38.926C32.0007 39.2001 31.9709 39.5017 32.0288 39.7926C32.0867 40.0836 32.2296 40.3509 32.4393 40.5607C32.6491 40.7704 32.9164 40.9133 33.2074 40.9712C33.4983 41.0291 33.7999 40.9994 34.074 40.8858C34.3481 40.7723 34.5824 40.58 34.7472 40.3334C34.912 40.0867 35 39.7967 35 39.5C35 39.1022 34.842 38.7206 34.5607 38.4393C34.2794 38.158 33.8978 38 33.5 38ZM52 41V44C52 44.5304 51.7893 45.0391 51.4142 45.4142C51.0391 45.7893 50.5304 46 50 46H26C25.4696 46 24.9609 45.7893 24.5858 45.4142C24.2107 45.0391 24 44.5304 24 44V41.1413C23.9982 39.2135 24.3897 37.3057 25.1506 35.5345C25.9114 33.7632 27.0256 32.1658 28.425 30.84L25.2925 27.7075C25.1049 27.5199 24.9995 27.2654 24.9995 27C24.9995 26.7346 25.1049 26.4801 25.2925 26.2925C25.4801 26.1049 25.7346 25.9994 26 25.9994C26.2654 25.9994 26.5199 26.1049 26.7075 26.2925L29.9775 29.5625C32.3254 27.8993 35.1308 27.0041 38.0081 26.9999C40.8854 26.9956 43.6934 27.8825 46.0463 29.5388L49.2963 26.2888C49.4839 26.1011 49.7384 25.9957 50.0038 25.9957C50.2691 25.9957 50.5236 26.1011 50.7113 26.2888C50.8989 26.4764 51.0043 26.7309 51.0043 26.9963C51.0043 27.2616 50.8989 27.5161 50.7113 27.7038L47.6025 30.8125C47.6963 30.9013 47.79 30.9913 47.8825 31.0838C49.1918 32.3813 50.23 33.9261 50.9369 35.6285C51.6438 37.3308 52.0051 39.1567 52 41ZM50 41C50 37.8174 48.7357 34.7652 46.4853 32.5147C44.2348 30.2643 41.1826 29 38 29H37.9575C31.3638 29.0225 26 34.4688 26 41.1413V44H50V41Z" fill="white"/>
            </svg>
          </div>
          <div class="user-details">
              <p>Пришелец-{{ name }}</p>
            </div>
          </div>
        </div>
        <div @click="logout()" style="background-color: #ff3f385e; display: inline-block; padding: 10px 30px; border-radius: 32px; margin: 32px 0; cursor: pointer;">
          <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M27 14V26C27 26.5304 26.7893 27.0391 26.4142 27.4142C26.0391 27.7893 25.5304 28 25 28H7C6.46957 28 5.96086 27.7893 5.58579 27.4142C5.21071 27.0391 5 26.5304 5 26V14C5 13.4696 5.21071 12.9609 5.58579 12.5858C5.96086 12.2107 6.46957 12 7 12H10C10.2652 12 10.5196 12.1054 10.7071 12.2929C10.8946 12.4804 11 12.7348 11 13C11 13.2652 10.8946 13.5196 10.7071 13.7071C10.5196 13.8946 10.2652 14 10 14H7V26H25V14H22C21.7348 14 21.4804 13.8946 21.2929 13.7071C21.1054 13.5196 21 13.2652 21 13C21 12.7348 21.1054 12.4804 21.2929 12.2929C21.4804 12.1054 21.7348 12 22 12H25C25.5304 12 26.0391 12.2107 26.4142 12.5858C26.7893 12.9609 27 13.4696 27 14ZM11.7075 8.7075L15 5.41375V17C15 17.2652 15.1054 17.5196 15.2929 17.7071C15.4804 17.8946 15.7348 18 16 18C16.2652 18 16.5196 17.8946 16.7071 17.7071C16.8946 17.5196 17 17.2652 17 17V5.41375L20.2925 8.7075C20.4801 8.89514 20.7346 9.00056 21 9.00056C21.2654 9.00056 21.5199 8.89514 21.7075 8.7075C21.8951 8.51986 22.0006 8.26537 22.0006 8C22.0006 7.73464 21.8951 7.48014 21.7075 7.2925L16.7075 2.2925C16.6146 2.19952 16.5043 2.12577 16.3829 2.07544C16.2615 2.02512 16.1314 1.99921 16 1.99921C15.8686 1.99921 15.7385 2.02512 15.6171 2.07544C15.4957 2.12577 15.3854 2.19952 15.2925 2.2925L10.2925 7.2925C10.1049 7.48014 9.99944 7.73464 9.99944 8C9.99944 8.26537 10.1049 8.51986 10.2925 8.7075C10.4801 8.89514 10.7346 9.00056 11 9.00056C11.2654 9.00056 11.5199 8.89514 11.7075 8.7075Z" fill="white"/>
          </svg>
        </div>
      </div>
      <div class="store-search">
        <div class="search-filters">
          <span>Поиск по магазину</span>
          <div style="display: flex; align-items: center; justify-content: start; margin-top: 25px; gap: 50px;">
          <div class="search-input">
            <input type="text" placeholder="Поиск...">
            <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M28.7073 27.2925L22.4485 21.035C24.2626 18.8571 25.1672 16.0637 24.9741 13.2359C24.781 10.4081 23.5052 7.76357 21.412 5.85246C19.3188 3.94135 16.5694 2.91081 13.7357 2.97521C10.902 3.03961 8.20225 4.194 6.19802 6.19822C4.1938 8.20245 3.03941 10.9022 2.97501 13.7359C2.91061 16.5695 3.94116 19.319 5.85226 21.4122C7.76337 23.5054 10.4079 24.7812 13.2357 24.9743C16.0635 25.1674 18.8569 24.2628 21.0348 22.4487L27.2923 28.7075C27.3852 28.8004 27.4955 28.8741 27.6169 28.9244C27.7383 28.9747 27.8684 29.0006 27.9998 29.0006C28.1312 29.0006 28.2613 28.9747 28.3827 28.9244C28.5041 28.8741 28.6144 28.8004 28.7073 28.7075C28.8002 28.6146 28.8739 28.5043 28.9242 28.3829C28.9745 28.2615 29.0004 28.1314 29.0004 28C29.0004 27.8686 28.9745 27.7385 28.9242 27.6171C28.8739 27.4957 28.8002 27.3854 28.7073 27.2925ZM4.9998 14C4.9998 12.22 5.52764 10.4799 6.51657 8.99986C7.5055 7.51982 8.91111 6.36627 10.5556 5.68508C12.2002 5.00389 14.0098 4.82566 15.7556 5.17293C17.5014 5.52019 19.1051 6.37736 20.3638 7.63603C21.6224 8.89471 22.4796 10.4984 22.8269 12.2442C23.1741 13.99 22.9959 15.7996 22.3147 17.4441C21.6335 19.0887 20.48 20.4943 18.9999 21.4832C17.5199 22.4722 15.7798 23 13.9998 23C11.6137 22.9973 9.32601 22.0483 7.63876 20.361C5.95151 18.6738 5.00244 16.3861 4.9998 14Z" fill="#5B657E"/>
            </svg>
          </div>
            <div style="display: flex; align-items: center;">
              <div style="background: #5c5f6846; border-radius: 30px; padding: 10px 20px; margin-right: 25px;">
                <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path d="M27 19C27 19.2652 26.8946 19.5196 26.7071 19.7071C26.5196 19.8946 26.2652 20 26 20H17V26.5862L19.2925 24.2925C19.4801 24.1049 19.7346 23.9994 20 23.9994C20.2654 23.9994 20.5199 24.1049 20.7075 24.2925C20.8951 24.4801 21.0006 24.7346 21.0006 25C21.0006 25.2654 20.8951 25.5199 20.7075 25.7075L16.7075 29.7075C16.6146 29.8005 16.5043 29.8742 16.3829 29.9246C16.2615 29.9749 16.1314 30.0008 16 30.0008C15.8686 30.0008 15.7385 29.9749 15.6171 29.9246C15.4957 29.8742 15.3854 29.8005 15.2925 29.7075L11.2925 25.7075C11.1049 25.5199 10.9994 25.2654 10.9994 25C10.9994 24.7346 11.1049 24.4801 11.2925 24.2925C11.4801 24.1049 11.7346 23.9994 12 23.9994C12.2654 23.9994 12.5199 24.1049 12.7075 24.2925L15 26.5862V20H6C5.73478 20 5.48043 19.8946 5.29289 19.7071C5.10536 19.5196 5 19.2652 5 19C5 18.7348 5.10536 18.4804 5.29289 18.2929C5.48043 18.1053 5.73478 18 6 18H26C26.2652 18 26.5196 18.1053 26.7071 18.2929C26.8946 18.4804 27 18.7348 27 19ZM6 14H26C26.2652 14 26.5196 13.8946 26.7071 13.7071C26.8946 13.5196 27 13.2652 27 13C27 12.7348 26.8946 12.4804 26.7071 12.2929C26.5196 12.1054 26.2652 12 26 12H17V5.41374L19.2925 7.70749C19.4801 7.89513 19.7346 8.00055 20 8.00055C20.2654 8.00055 20.5199 7.89513 20.7075 7.70749C20.8951 7.51985 21.0006 7.26536 21.0006 6.99999C21.0006 6.73463 20.8951 6.48013 20.7075 6.29249L16.7075 2.29249C16.6146 2.19952 16.5043 2.12576 16.3829 2.07543C16.2615 2.02511 16.1314 1.99921 16 1.99921C15.8686 1.99921 15.7385 2.02511 15.6171 2.07543C15.4957 2.12576 15.3854 2.19952 15.2925 2.2925L11.2925 6.29249C11.1049 6.48013 10.9994 6.73463 10.9994 6.99999C10.9994 7.26536 11.1049 7.51985 11.2925 7.70749C11.4801 7.89513 11.7346 8.00055 12 8.00055C12.2654 8.00055 12.5199 7.89513 12.7075 7.70749L15 5.41374V12H6C5.73478 12 5.48043 12.1054 5.29289 12.2929C5.10536 12.4804 5 12.7348 5 13C5 13.2652 5.10536 13.5196 5.29289 13.7071C5.48043 13.8946 5.73478 14 6 14Z" fill="white"/>
                </svg>
              </div>
              <span>По умолчанию</span>
            </div>
          </div>
        </div>
        <div class="product-list">
          <div v-if="filteredProducts.length === 0">
            <p>Товаров нет</p>
          </div>
          <div v-else v-for="product in filteredProducts" :key="product.title" class="item-product" @click="openModal(product)">
            <div class="item-product-foto">
              <img :src="product.image" alt="">
            </div>
            <div class="text-wrapper">
              <div>
                <div class="title">
                  {{ product.title }}
                </div>
                <div class="description">
                  {{ product.description }}
                </div>
              </div>
              <div class="buttons">
                <div class="price">
                  {{ product.price }} ₽
                </div>
                <div class="like" :style="{ backgroundColor: isInCartText(product.id) ? '#ff3f385e' : 'transparent' }">
                  <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M16.6875 3.75C14.7516 3.75 13.0566 4.5825 12 5.98969C10.9434 4.5825 9.24844 3.75 7.3125 3.75C5.77146 3.75174 4.29404 4.36468 3.20436 5.45436C2.11468 6.54404 1.50174 8.02146 1.5 9.5625C1.5 16.125 11.2303 21.4369 11.6447 21.6562C11.7539 21.715 11.876 21.7458 12 21.7458C12.124 21.7458 12.2461 21.715 12.3553 21.6562C12.7697 21.4369 22.5 16.125 22.5 9.5625C22.4983 8.02146 21.8853 6.54404 20.7956 5.45436C19.706 4.36468 18.2285 3.75174 16.6875 3.75ZM12 20.1375C10.2881 19.14 3 14.5959 3 9.5625C3.00149 8.41921 3.45632 7.32317 4.26475 6.51475C5.07317 5.70632 6.16921 5.25149 7.3125 5.25C9.13594 5.25 10.6669 6.22125 11.3062 7.78125C11.3628 7.91881 11.4589 8.03646 11.5824 8.11926C11.7059 8.20207 11.8513 8.24627 12 8.24627C12.1487 8.24627 12.2941 8.20207 12.4176 8.11926C12.5411 8.03646 12.6372 7.91881 12.6937 7.78125C13.3331 6.21844 14.8641 5.25 16.6875 5.25C17.8308 5.25149 18.9268 5.70632 19.7353 6.51475C20.5437 7.32317 20.9985 8.41921 21 9.5625C21 14.5884 13.71 19.1391 12 20.1375Z" fill="white"/>
                  </svg>
                </div>
                <div class="rate">
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.2041 7.21117C13.8929 4.18151 14.7373 2.66667 15.9998 2.66667C17.2624 2.66667 18.1068 4.18149 19.7956 7.21116L20.2325 7.99497C20.7125 8.85591 20.9524 9.28639 21.3266 9.57041C21.7008 9.85444 22.1666 9.95987 23.0986 10.1707L23.9472 10.3627C27.2266 11.1047 28.8665 11.4758 29.2566 12.7303C29.6468 13.9848 28.5289 15.2921 26.293 17.9065L25.7146 18.5829C25.0793 19.3259 24.7616 19.6973 24.6186 20.1569C24.4758 20.6165 24.5238 21.1121 24.6198 22.1035L24.7073 23.0059C25.0453 26.4941 25.2144 28.2383 24.193 29.0136C23.1716 29.7889 21.6362 29.082 18.5656 27.6683L17.7712 27.3024C16.8986 26.9007 16.4624 26.6997 15.9998 26.6997C15.5373 26.6997 15.101 26.9007 14.2285 27.3024L13.4341 27.6683C10.3634 29.082 8.82808 29.7889 7.80671 29.0136C6.78533 28.2383 6.95435 26.4941 7.29237 23.0059L7.37981 22.1035C7.47588 21.1121 7.52391 20.6165 7.38099 20.1569C7.23808 19.6973 6.92041 19.3259 6.28507 18.5829L5.70664 17.9065C3.47084 15.2921 2.35293 13.9848 2.74307 12.7303C3.1332 11.4758 4.77299 11.1047 8.05256 10.3627L8.90103 10.1707C9.83297 9.95987 10.2989 9.85444 10.6731 9.57041C11.0472 9.28639 11.2872 8.85592 11.7671 7.99497L12.2041 7.21117Z" fill="#B39906"/>
                  </svg>
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.2041 7.21117C13.8929 4.18151 14.7373 2.66667 15.9998 2.66667C17.2624 2.66667 18.1068 4.18149 19.7956 7.21116L20.2325 7.99497C20.7125 8.85591 20.9524 9.28639 21.3266 9.57041C21.7008 9.85444 22.1666 9.95987 23.0986 10.1707L23.9472 10.3627C27.2266 11.1047 28.8665 11.4758 29.2566 12.7303C29.6468 13.9848 28.5289 15.2921 26.293 17.9065L25.7146 18.5829C25.0793 19.3259 24.7616 19.6973 24.6186 20.1569C24.4758 20.6165 24.5238 21.1121 24.6198 22.1035L24.7073 23.0059C25.0453 26.4941 25.2144 28.2383 24.193 29.0136C23.1716 29.7889 21.6362 29.082 18.5656 27.6683L17.7712 27.3024C16.8986 26.9007 16.4624 26.6997 15.9998 26.6997C15.5373 26.6997 15.101 26.9007 14.2285 27.3024L13.4341 27.6683C10.3634 29.082 8.82808 29.7889 7.80671 29.0136C6.78533 28.2383 6.95435 26.4941 7.29237 23.0059L7.37981 22.1035C7.47588 21.1121 7.52391 20.6165 7.38099 20.1569C7.23808 19.6973 6.92041 19.3259 6.28507 18.5829L5.70664 17.9065C3.47084 15.2921 2.35293 13.9848 2.74307 12.7303C3.1332 11.4758 4.77299 11.1047 8.05256 10.3627L8.90103 10.1707C9.83297 9.95987 10.2989 9.85444 10.6731 9.57041C11.0472 9.28639 11.2872 8.85592 11.7671 7.99497L12.2041 7.21117Z" fill="#B39906"/>
                  </svg>
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.2041 7.21117C13.8929 4.18151 14.7373 2.66667 15.9998 2.66667C17.2624 2.66667 18.1068 4.18149 19.7956 7.21116L20.2325 7.99497C20.7125 8.85591 20.9524 9.28639 21.3266 9.57041C21.7008 9.85444 22.1666 9.95987 23.0986 10.1707L23.9472 10.3627C27.2266 11.1047 28.8665 11.4758 29.2566 12.7303C29.6468 13.9848 28.5289 15.2921 26.293 17.9065L25.7146 18.5829C25.0793 19.3259 24.7616 19.6973 24.6186 20.1569C24.4758 20.6165 24.5238 21.1121 24.6198 22.1035L24.7073 23.0059C25.0453 26.4941 25.2144 28.2383 24.193 29.0136C23.1716 29.7889 21.6362 29.082 18.5656 27.6683L17.7712 27.3024C16.8986 26.9007 16.4624 26.6997 15.9998 26.6997C15.5373 26.6997 15.101 26.9007 14.2285 27.3024L13.4341 27.6683C10.3634 29.082 8.82808 29.7889 7.80671 29.0136C6.78533 28.2383 6.95435 26.4941 7.29237 23.0059L7.37981 22.1035C7.47588 21.1121 7.52391 20.6165 7.38099 20.1569C7.23808 19.6973 6.92041 19.3259 6.28507 18.5829L5.70664 17.9065C3.47084 15.2921 2.35293 13.9848 2.74307 12.7303C3.1332 11.4758 4.77299 11.1047 8.05256 10.3627L8.90103 10.1707C9.83297 9.95987 10.2989 9.85444 10.6731 9.57041C11.0472 9.28639 11.2872 8.85592 11.7671 7.99497L12.2041 7.21117Z" fill="#B39906"/>
                  </svg>
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.2041 7.21117C13.8929 4.18151 14.7373 2.66667 15.9998 2.66667C17.2624 2.66667 18.1068 4.18149 19.7956 7.21116L20.2325 7.99497C20.7125 8.85591 20.9524 9.28639 21.3266 9.57041C21.7008 9.85444 22.1666 9.95987 23.0986 10.1707L23.9472 10.3627C27.2266 11.1047 28.8665 11.4758 29.2566 12.7303C29.6468 13.9848 28.5289 15.2921 26.293 17.9065L25.7146 18.5829C25.0793 19.3259 24.7616 19.6973 24.6186 20.1569C24.4758 20.6165 24.5238 21.1121 24.6198 22.1035L24.7073 23.0059C25.0453 26.4941 25.2144 28.2383 24.193 29.0136C23.1716 29.7889 21.6362 29.082 18.5656 27.6683L17.7712 27.3024C16.8986 26.9007 16.4624 26.6997 15.9998 26.6997C15.5373 26.6997 15.101 26.9007 14.2285 27.3024L13.4341 27.6683C10.3634 29.082 8.82808 29.7889 7.80671 29.0136C6.78533 28.2383 6.95435 26.4941 7.29237 23.0059L7.37981 22.1035C7.47588 21.1121 7.52391 20.6165 7.38099 20.1569C7.23808 19.6973 6.92041 19.3259 6.28507 18.5829L5.70664 17.9065C3.47084 15.2921 2.35293 13.9848 2.74307 12.7303C3.1332 11.4758 4.77299 11.1047 8.05256 10.3627L8.90103 10.1707C9.83297 9.95987 10.2989 9.85444 10.6731 9.57041C11.0472 9.28639 11.2872 8.85592 11.7671 7.99497L12.2041 7.21117Z" fill="#B39906"/>
                  </svg>
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M12.2041 7.21117C13.8929 4.18151 14.7373 2.66667 15.9998 2.66667C17.2624 2.66667 18.1068 4.18149 19.7956 7.21116L20.2325 7.99497C20.7125 8.85591 20.9524 9.28639 21.3266 9.57041C21.7008 9.85444 22.1666 9.95987 23.0986 10.1707L23.9472 10.3627C27.2266 11.1047 28.8665 11.4758 29.2566 12.7303C29.6468 13.9848 28.5289 15.2921 26.293 17.9065L25.7146 18.5829C25.0793 19.3259 24.7616 19.6973 24.6186 20.1569C24.4758 20.6165 24.5238 21.1121 24.6198 22.1035L24.7073 23.0059C25.0453 26.4941 25.2144 28.2383 24.193 29.0136C23.1716 29.7889 21.6362 29.082 18.5656 27.6683L17.7712 27.3024C16.8986 26.9007 16.4624 26.6997 15.9998 26.6997C15.5373 26.6997 15.101 26.9007 14.2285 27.3024L13.4341 27.6683C10.3634 29.082 8.82808 29.7889 7.80671 29.0136C6.78533 28.2383 6.95435 26.4941 7.29237 23.0059L7.37981 22.1035C7.47588 21.1121 7.52391 20.6165 7.38099 20.1569C7.23808 19.6973 6.92041 19.3259 6.28507 18.5829L5.70664 17.9065C3.47084 15.2921 2.35293 13.9848 2.74307 12.7303C3.1332 11.4758 4.77299 11.1047 8.05256 10.3627L8.90103 10.1707C9.83297 9.95987 10.2989 9.85444 10.6731 9.57041C11.0472 9.28639 11.2872 8.85592 11.7671 7.99497L12.2041 7.21117Z" fill="#B39906"/>
                  </svg>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
  </div>
  <div v-if="isModalOpen" class="modal" @click.self="closeModal">
    <div class="modal-content">
      <div style="display: flex; text-align: start; gap: 10px;">
        <div class="item-product-foto">
          <img :src="currentProduct.image" alt="">
        </div>
        <div>
          <div class="title">
            {{ currentProduct.title }}
          </div>
          <div class="description">
            {{ currentProduct.description }}
          </div>
        </div>
      </div>
      <div class="modal-body">
        <p style="color: #93A0B9; font-size: 12px; text-align: start;">При оформлении покупки на вашу электронную почту будет отправлен чек. Кроме того, при изменении статуса заказа вы получите уведомление на указанный адрес электронной почты. После подтверждения оплаты доставка будет осуществлена по указанному вами адресу.</p>
      </div>
      <div class="modal-footer" style="display: flex; justify-content: space-between;">
        <div class="like">
          <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M21.6468 6.90001C21.3535 6.75623 21.0209 6.71312 20.7006 6.77735C20.3804 6.84158 20.0901 7.00956 19.8749 7.25532L16.7184 10.6575L13.3621 3.13032C13.362 3.1272 13.362 3.12407 13.3621 3.12094C13.2421 2.86064 13.05 2.64018 12.8086 2.48565C12.5672 2.33112 12.2866 2.24899 11.9999 2.24899C11.7133 2.24899 11.4327 2.33112 11.1912 2.48565C10.9498 2.64018 10.7578 2.86064 10.6377 3.12094C10.6379 3.12407 10.6379 3.1272 10.6377 3.13032L7.28149 10.6575L4.12493 7.25532C3.90833 7.00952 3.61722 6.84138 3.29607 6.77661C2.97493 6.71184 2.6414 6.75399 2.34646 6.89662C2.05153 7.03926 1.8114 7.27453 1.66277 7.56649C1.51413 7.85845 1.46517 8.19104 1.52337 8.51344C1.52337 8.52376 1.52337 8.53313 1.52993 8.54344L3.65618 18.2813C3.72163 18.6242 3.90463 18.9335 4.17365 19.1559C4.44266 19.3784 4.78084 19.5001 5.12993 19.5H18.8709C19.2198 19.4999 19.5578 19.3781 19.8266 19.1556C20.0954 18.9332 20.2783 18.624 20.3437 18.2813L22.4699 8.54344C22.4699 8.53313 22.4699 8.52376 22.4765 8.51344C22.5358 8.19064 22.4866 7.85728 22.3365 7.5654C22.1864 7.27353 21.9439 7.03955 21.6468 6.90001ZM18.8765 17.97L18.8709 18H5.12899L5.12337 17.97L2.99993 8.25001L3.01305 8.26501L6.95055 12.5063C7.03487 12.5974 7.14048 12.6661 7.25791 12.7064C7.37534 12.7466 7.50093 12.7571 7.6234 12.7368C7.74587 12.7165 7.8614 12.6662 7.95962 12.5903C8.05785 12.5144 8.13569 12.4153 8.18618 12.3019L11.9999 3.75001L15.8146 12.3047C15.8651 12.4181 15.943 12.5172 16.0412 12.5931C16.1394 12.669 16.2549 12.7194 16.3774 12.7396C16.4999 12.7599 16.6255 12.7494 16.7429 12.7092C16.8603 12.6689 16.9659 12.6002 17.0502 12.5091L20.9877 8.26782L20.9999 8.25001L18.8765 17.97Z" fill="#FFCD37"/>
          </svg>
        </div>
        <div style="display: flex; justify-content: space-between; gap: 20px;">
          <div class="price">
            {{ currentProduct.price }} ₽
          </div>
          <div :style="{ backgroundColor: isInCart ? '#ff3f385e' : '#38e2575b' }" style="padding: 5px 20px; border-radius: 32px; display: flex; justify-content: center; align-items: center; cursor: pointer;" @click="confirmPurchase">
            {{ isInCart ? 'Отменить' : 'Оформить' }}
          </div>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
import { products } from '@/data/products';

export default {
  name: 'MainPage',
  data() {
    return {
      products,
      name: 'SN55417',
      categories: ['Смартфоны', 'ПК, ноутбуки', 'Комплектующие для ПК'],
      filteredProducts: products,
      activeCategory: null,
      isModalOpen: false,
      currentProduct: null,
      buttonText: 'Оформить'
    };
  },
  computed: {
    isInCart() {
      if (!this.currentProduct) return false; // Если currentProduct нет — возвращаем false
      const cartItems = JSON.parse(localStorage.getItem('cartItems') || '[]');
      return cartItems.includes(this.currentProduct.id);
    }
  },
  methods: {
    filterProductsByCategory(category) {
      this.activeCategory = category;
      if (category === 'Смартфоны') {
        this.filteredProducts = products.filter(product => product.type === 'phone');
      } else if (category === 'ПК, ноутбуки') {
        this.filteredProducts = products.filter(product => product.type === 'PK');
      } else if (category === 'Комплектующие для ПК') {
        this.filteredProducts = products.filter(product => product.type === 'accessories');
      } else {
        this.filteredProducts = products;
      }
    },
    openModal(product) {
      this.currentProduct = product;
      this.isModalOpen = true;
    },
    closeModal() {
      this.isModalOpen = false;
      this.currentProduct = null;
      this.buttonText = 'Оформить';
    },
    confirmPurchase() {
      if (this.isInCart) {
        const cartItems = JSON.parse(localStorage.getItem('cartItems') || '[]');
        const updatedCart = cartItems.filter(id => id !== this.currentProduct.id);
        localStorage.setItem('cartItems', JSON.stringify(updatedCart));
        this.buttonText = 'Оформлено';
      } else {
        localStorage.setItem('cartItems', JSON.stringify([...JSON.parse(localStorage.getItem('cartItems') || '[]'), this.currentProduct.id]));
        this.buttonText = 'Оформлено';
      }
      setTimeout(() => {
        this.closeModal();
      }, 2000);
    },
    logout() {
      const authStore = useAuthStore();
      const router = useRouter();
      authStore.logout();
      router.push('/auth/login');
    },
    isInCartText(productId) {
      const cartItems = JSON.parse(localStorage.getItem('cartItems') || '[]');
      return cartItems.includes(productId);
    }
  }
};
</script>

<style scoped>
.main-page {
  text-align: center;
  margin-top: 50px;
  color: white;
  background-color: #18191c;
  min-height: 100vh;
  padding: 20px;
  max-width: 1200px;
  width: 100%;
  margin: 0 auto;
}

.item-product-foto img{
  width: 200px;
  height: 150px;
}

.catalog {
  display: flex;
  justify-content: space-between;
  margin-bottom: 20px;
}

.item-catalog {
  background: #5c5f6846;
  border-radius: 30px;
  text-align: center;
  padding: 10px 50px;
  display: flex;
  align-items: center;
  justify-content: center;
  cursor: pointer;
}

.item-catalog:hover{
  background-color: #33333346;
}

.item-catalog.active {
  background-color: #007bff;
}

.main-wrapper {
  display: flex;
  gap: 20px;
}

.profile-wrapper {
  background: #5c5f6846;
  padding: 20px;
  border-radius: 32px;
}

.profile-info {
  display: flex;
  flex-direction: column;
  align-items: center;
}

.avatar img {
  width: 100px;
  height: 100px;
  border-radius: 50%;
  margin-bottom: 10px;
}

.user-details {
  text-align: center;
}

.store-search {
  width: 75%;
  overflow-y: auto;
}

.search-filters {
  margin-bottom: 20px;
  text-align: start;
  position: relative;
}

.search-input {
  display: flex;
  align-items: center;
  background-color: #20242D;
  border: 2px solid #5B657E;
  border-radius: 14px;
  max-width: 350px;
  width: 100%;
  padding: 5px;
}

.search-input input {
  background-color: #20242D;
  border: none;
  color: white;
  padding: 10px;
  border-radius: 14px;
  width: 100%;
  outline: none;
  transition: border-color 0.3s ease;
}

.search-input input::placeholder {
  color: #5B657E;
}

.search-input input:focus {
  border-color: #007bff;
}

.search-input svg {
  margin-left: 10px;
  cursor: pointer;
}

.product-list {
  display: flex;
  flex-wrap: wrap;
  gap: 50px;
}

.item-product {
  display: flex;
  border-radius: 10px;
  width: 100%;
  box-sizing: border-box;
  cursor: pointer;
}

.item-product:hover{
  background-color: #33333346;
}

.text-wrapper {
  text-align: start;
  display: flex;
  flex-direction: column;
  justify-content: space-between;
  align-items: center;
  padding: 0 10px;
}

.title {
  font-size: 16px;
  font-weight: bold;
  margin-bottom: 5px;
}

.description {
  font-size: 14px;
  color: #93A0B9;
  margin-bottom: 10px;
}

.buttons {
  display: flex;
  align-items: center;
  gap: 20px;
  width: 100%;
}

.price, .like{
  display: flex;
  justify-content: center;
  align-items: center;
  font-size: 16px;
  font-weight: bold;
  background: #5c5f6846;
  padding: 5px 20px;
  border-radius: 32px;
  height: 32px;
}

.like,
.rate {
  cursor: pointer;
  transition: fill 0.3s;
}

.like svg:hover,
.rate svg:hover {
  fill: #007bff;
}

.modal {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, 0.5);
  display: flex;
  justify-content: center;
  align-items: center;
}

.modal-content {
  max-width: 800px;
  background-color: #18191c;
  padding: 20px;
  border-radius: 10px;
  width: 100%;
  text-align: center;
}

.modal-header {
  display: flex;
  justify-content: space-between;
  align-items: center;
  margin-bottom: 20px;
}

.modal-header button {
  background-color: #ff3f385e;
  border: none;
  color: white;
  padding: 10px 20px;
  border-radius: 32px;
  cursor: pointer;
}

.modal-body img {
  max-width: 100%;
  height: auto;
  margin-bottom: 20px;
}

.modal-body button {
  background-color: #007bff;
  border: none;
  color: white;
  padding: 10px 20px;
  border-radius: 32px;
  cursor: pointer;
  margin-top: 20px;
}
</style>
